/*
   Copyright (c) 2015-2021 hkrn All rights reserved

   This file is part of nanoem component and it's licensed under MIT license. see LICENSE.md for more details.
 */

#ifndef NANOEM_H_
#define NANOEM_H_

#if defined(__STDC_VERSION__) && __STDC_VERSION__ >= 201112L /* C11 */
#define __STDC_WANT_LIB_EXT1__ 1 /* define for rsize_t */
#endif

#include <stddef.h> /* size_t */
#ifdef _WIN32
#include <windows.h>
#endif /* _WIN32 */

/**
 * \defgroup nanoem nanoem
 * @{
 */

#if defined(__STDC_VERSION__) && __STDC_VERSION__ >= 201112L /* C11 */
#ifndef NANOEM_STATIC_ASSERT
#define NANOEM_STATIC_ASSERT _Static_assert
#endif /* NANOEM_STATIC_ASSERT */
#ifdef RSIZE_MAX
typedef rsize_t nanoem_rsize_t;
#else
typedef size_t nanoem_rsize_t;
#endif /* RSIZE_MAX */
#elif !defined(__cplusplus)
#ifndef NANOEM_STATIC_ASSERT
#define __NANOEM_SA_CONCAT(a, b) __NANOEM_SA_CONCAT2(a, b)
#define __NANOEM_SA_CONCAT2(a, b) a##b
#define NANOEM_STATIC_ASSERT(cond, message)                              \
    enum { __NANOEM_SA_CONCAT(NANOEM_STATIC_ASSERT_LINE_AT_, __LINE__) = \
               sizeof(struct __NANOEM_SA_CONCAT(__nanoem_static_assert_line_at_, __LINE__) { int static_assertion_failed[(cond) ? 1 : -1]; }) }
#endif /* NANOEM_STATIC_ASSERT */
typedef size_t nanoem_rsize_t;
#else
#define NANOEM_STATIC_ASSERT(cond, message)
typedef size_t nanoem_rsize_t;
#endif /* __STDC_VERSION__ >= 201112L */

/**
 * \brief Declares a typed (C++11 only) enum
 */
#ifndef NANOEM_DECL_ENUM

typedef unsigned __int16 nanoem_u16_t;
typedef signed __int32 nanoem_i32_t;
typedef unsigned __int32 nanoem_u32_t;
typedef signed __int64 nanoem_i64_t;
typedef unsigned __int64 nanoem_u64_t;
#ifndef NANOEM_DECL_INLINE
#define NANOEM_DECL_INLINE __inline
#endif /* NANOEM_DECL_INLINE */
#else /* defined(__STDC_VERSION__) && __STDC_VERSION__ >= 199901L */
typedef unsigned char nanoem_u8_t;
typedef short nanoem_i16_t;
typedef unsigned short nanoem_u16_t;
typedef int nanoem_i32_t;
typedef unsigned int nanoem_u32_t;
typedef long long nanoem_i64_t;
typedef unsigned long long nanoem_u64_t;
#ifndef NANOEM_DECL_INLINE
#define NANOEM_DECL_INLINE
#endif /* NANOEM_DECL_INLINE */
#endif /* defined(__STDC_VERSION__) && __STDC_VERSION__ >= 199901L */

typedef int nanoem_bool_t;
typedef float nanoem_f32_t;
typedef double nanoem_f64_t;

/* utility macros */
#ifdef NANOEM_ENABLE_BRANCH_PREDICTION
#ifndef nanoem_likely
#define nanoem_likely(expr) __builtin_expect(!!(expr), 1)
#endif /* nanoem_likely */
#ifndef nanoem_unlikely
#define nanoem_unlikely(expr) __builtin_expect(!!(expr), 0)
#endif /* nanoem_unlikely */
#else
#ifndef nanoem_likely
#define nanoem_likely(expr) (expr)
#endif /* nanoem_likely */
#ifndef nanoem_unlikely
#define nanoem_unlikely(expr) (expr)
#endif /* nanoem_unlikely */
#endif /* NANOEM_ENABLE_BRANCH_PREDICTION */

#ifndef nanoem_is_null
#define nanoem_is_null(cond) (nanoem_unlikely((cond) == NULL))
#endif /* nanoem_is_null */
#ifndef nanoem_is_not_null
#define nanoem_is_not_null(cond) (nanoem_likely((cond) != NULL))
#endif /* nanoem_is_not_null */
#ifndef nanoem_mark_unused
#define nanoem_mark_unused(cond)              \
    for (;;) {                                \
        (void)(0 ? (void) (cond) : (void) 0); \
        break;                                \
    }
#endif /* nanoem_mark_unused */

#ifndef nanoem_fourcc
#define nanoem_fourcc(a, b, c, d) (nanoem_u32_t) ((a) << 0 | (b) << 8 | (c) << 16 | (d) << 24)
#endif /* nanoem_fourcc */

#if defined(NANOEM_BUILDING_DLL)
#ifdef __cplusplus
#define _NANOEM_DECL_API extern "C"
#else
#define _NANOEM_DECL_API extern
#endif /* __cplusplus */
#if defined(_WIN32)
#ifdef NANOEM_DLL_EXPORTS
#define NANOEM_DECL_API _NANOEM_DECL_API __declspec(dllexport)
#else
#define NANOEM_DECL_API _NANOEM_DECL_API __declspec(dllimport)
#endif
#elif defined(__GNUC__)
#ifdef __cplusplus
#define NANOEM_DECL_API __attribute__((visibility("default"))) _NANOEM_DECL_API
#else
#define NANOEM_DECL_API __attribute__((visibility("default"))) _NANOEM_DECL_API
#endif /* __cplusplus */
#endif
#endif /* NANOEM_BUILDING_DLL */

#ifndef NANOEM_DECL_API
#ifdef __cplusplus
#define NANOEM_DECL_API extern "C"
#else
#define NANOEM_DECL_API extern
#endif /* __cplusplus */
#endif /* NANOEM_DECL_API */

#ifndef NANOEM_RSIZE_MAX
#ifdef RSIZE_MAX
#define NANOEM_RSIZE_MAX RSIZE_MAX
#else
#define NANOEM_RSIZE_MAX ((~(size_t)(0)) >> 1)
#endif /* RSIZE_MAX */
#endif /* NANOEM_RSIZE_MAX */

#ifndef APIENTRY
#define APIENTRY
#endif /* APIENTRY */

NANOEM_STATIC_ASSERT(sizeof(nanoem_u8_t) == 1, "size of nanoem_u8_t must be 1");
NANOEM_STATIC_ASSERT(sizeof(nanoem_i16_t) == 2, "size of nanoem_i16_t must be 2");
NANOEM_STATIC_ASSERT(sizeof(nanoem_u16_t) == 2, "size of nanoem_u16_t must be 2");
NANOEM_STATIC_ASSERT(sizeof(nanoem_i32_t) == 4, "size of nanoem_i32_t must be 4");
NANOEM_STATIC_ASSERT(sizeof(nanoem_u32_t) == 4, "size of nanoem_u32_t must be 4");
NANOEM_STATIC_ASSERT(sizeof(nanoem_i64_t) == 8, "size of nanoem_i64_t must be 8");
NANOEM_STATIC_ASSERT(sizeof(nanoem_u64_t) == 8, "size of nanoem_u64_t must be 8");
NANOEM_STATIC_ASSERT(sizeof(nanoem_f32_t) == 4, "size of nanoem_f32_t must be 4");
NANOEM_STATIC_ASSERT(sizeof(nanoem_f64_t) == 8, "size of nanoem_f64_t must be 8");

NANOEM_DECL_OPAQUE(nanoem_user_data_t);

/**
 * \brief The status enum
 */
NANOEM_DECL_ENUM(nanoem_i32_t, nanoem_status_t){
    NANOEM_STATUS_UNKNOWN = -1, ///< Unknown
    NANOEM_STATUS_FIRST_ENUM, ///< Success
    NANOEM_STATUS_SUCCESS = NANOEM_STATUS_FIRST_ENUM,
    NANOEM_STATUS_ERROR_MALLOC_FAILED, // Failed to allocate memory
    NANOEM_STATUS_ERROR_REALLOC_FAILED, ///< Failed to allocate memory
    NANOEM_STATUS_ERROR_NULL_OBJECT, ///< Null object is referred
    NANOEM_STATUS_ERROR_BUFFER_END, ///< Buffer is end
    NANOEM_STATUS_ERROR_DECODE_UNICODE_STRING_FAILED, ///< Failed to decode unicode string
    NANOEM_STATUS_ERROR_ENCODE_UNICODE_STRING_FAILED, ///< Failed to encode unicode string
    NANOEM_STATUS_ERROR_INVALID_SIGNATURE = 100, ///< Invalid signature
    NANOEM_STATUS_ERROR_MODEL_VERTEX_CORRUPTED, ///< Vertex data is corrupted
